PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.c
/***************************************************************************//**
*
* \file ifx_se_psacrypto.c
* \version 1.1.0
*
* \brief
*  This is the source code file for Secure Services psa crypto syscalls.
*
********************************************************************************
* \copyright
* Copyright 2022-2024, Cypress Semiconductor Corporation (an Infineon company).
* All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "ifx_se_psacrypto.h"
#include "ifx_se_syscall.h"
#include "ifx_se_memory.h"

#include "cy_device.h"
#include "cy_utils.h"

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 8.13', 38, \
                             'The "operation" context changes inside SE RT Services.')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 59, \
                             'Intentional typecast of "ipc_packet[]" to "ifx_se_fih_uint *" type.')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.4', 103, \
                             'Intentional typecast of "ipc_packet" to an integer type.')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Directive 4.9', 221, \
                             'Use function-like macro as simple inline functions.')

ifx_se_status_t ifx_se_sign_hash(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t hash,
    ifx_se_fih_t hash_length,
    const ifx_se_fih_ptr_t signature,
    ifx_se_fih_t signature_size,
    ifx_se_fih_ptr_t signature_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 8 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(8u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_SIGN_HASH;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(hash);
    ipc_params[5] = hash_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(signature);
    ipc_params[7] = signature_size;
    ipc_params[8] = ifx_se_fih_ptr_to_uint(signature_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_verify_hash(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t hash,
    ifx_se_fih_t hash_length,
    const ifx_se_fih_ptr_t signature,
    ifx_se_fih_t signature_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 7 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(7u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_VERIFY_HASH;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(hash);
    ipc_params[5] = hash_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(signature);
    ipc_params[7] = signature_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_sign_message(ifx_se_key_id_fih_t key,
                                    ifx_se_alg_fih_t alg,
                                    const ifx_se_fih_ptr_t input,
                                    ifx_se_fih_t input_length,
                                    ifx_se_fih_ptr_t signature,
                                    ifx_se_fih_t signature_size,
                                    ifx_se_fih_ptr_t signature_length,
                                    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 8 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(8u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_SIGN_MESSAGE;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[5] = input_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(signature);
    ipc_params[7] = signature_size;
    ipc_params[8] = ifx_se_fih_ptr_to_uint(signature_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_verify_message(ifx_se_key_id_fih_t key,
                                      ifx_se_alg_fih_t alg,
                                      const ifx_se_fih_ptr_t input,
                                      ifx_se_fih_t input_length,
                                      const ifx_se_fih_ptr_t signature,
                                      ifx_se_fih_t signature_length,
                                      void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 7 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(7u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_VERIFY_MESSAGE;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[5] = input_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(signature);
    ipc_params[7] = signature_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_encrypt(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t nonce,
    ifx_se_fih_t nonce_length,
    const ifx_se_fih_ptr_t additional_data,
    ifx_se_fih_t additional_data_length,
    const ifx_se_fih_ptr_t plaintext,
    ifx_se_fih_t plaintext_length,
    const ifx_se_fih_ptr_t ciphertext,
    ifx_se_fih_t ciphertext_size,
    ifx_se_fih_ptr_t ciphertext_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

