PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.c
    /* 12 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(12u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_ENCRYPT;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(nonce);
    ipc_params[5] = nonce_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(additional_data);
    ipc_params[7] = additional_data_length;
    ipc_params[8] = ifx_se_fih_ptr_to_uint(plaintext);
    ipc_params[9] = plaintext_length;
    ipc_params[10] = ifx_se_fih_ptr_to_uint(ciphertext);
    ipc_params[11] = ciphertext_size;
    ipc_params[12] = ifx_se_fih_ptr_to_uint(ciphertext_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_decrypt(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t nonce,
    ifx_se_fih_t nonce_length,
    const ifx_se_fih_ptr_t additional_data,
    ifx_se_fih_t additional_data_length,
    const ifx_se_fih_ptr_t ciphertext,
    ifx_se_fih_t ciphertext_length,
    const ifx_se_fih_ptr_t plaintext,
    ifx_se_fih_t plaintext_size,
    ifx_se_fih_ptr_t plaintext_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 12 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(12u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_DECRYPT;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(nonce);
    ipc_params[5] = nonce_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(additional_data);
    ipc_params[7] = additional_data_length;
    ipc_params[8] = ifx_se_fih_ptr_to_uint(ciphertext);
    ipc_params[9] = ciphertext_length;
    ipc_params[10] = ifx_se_fih_ptr_to_uint(plaintext);
    ipc_params[11] = plaintext_size;
    ipc_params[12] = ifx_se_fih_ptr_to_uint(plaintext_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_encrypt_setup(ifx_se_aead_operation_t *operation,
        ifx_se_key_id_fih_t key,
        ifx_se_alg_fih_t alg,
        void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_ENCRYPT_SETUP;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = key.key_id;
    ipc_params[3] = key.owner;
    ipc_params[4] = alg;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_decrypt_setup(ifx_se_aead_operation_t *operation,
        ifx_se_key_id_fih_t key,
        ifx_se_alg_fih_t alg,
        void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_DECRYPT_SETUP;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = key.key_id;
    ipc_params[3] = key.owner;
    ipc_params[4] = alg;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_generate_nonce(ifx_se_aead_operation_t *operation,
        ifx_se_fih_ptr_t nonce,
        ifx_se_fih_t nonce_size,
        ifx_se_fih_ptr_t nonce_length,
        void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_GENERATE_NONCE;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(nonce);
    ipc_params[3] = nonce_size;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(nonce_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_set_nonce(ifx_se_aead_operation_t *operation,
                                      const ifx_se_fih_ptr_t nonce,
                                      ifx_se_fih_t nonce_length,
                                      void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 3 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(3u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_SET_NONCE;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(nonce);
    ipc_params[3] = nonce_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_set_lengths(ifx_se_aead_operation_t *operation,
                                        ifx_se_fih_t ad_length,
                                        ifx_se_fih_t plaintext_length,
                                        void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 3 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(3u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

