PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.c
    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_SET_LENGTHS;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ad_length;
    ipc_params[3] = plaintext_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_update_ad(ifx_se_aead_operation_t *operation,
                                      const ifx_se_fih_ptr_t input,
                                      ifx_se_fih_t input_length,
                                      void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 3 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(3u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_UPDATE_AD;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[3] = input_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_update(ifx_se_aead_operation_t *operation,
                                   const ifx_se_fih_ptr_t input,
                                   ifx_se_fih_t input_length,
                                   ifx_se_fih_ptr_t output,
                                   ifx_se_fih_t output_size,
                                   ifx_se_fih_ptr_t output_length,
                                   void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 6 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(6u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_UPDATE;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[3] = input_length;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(output);
    ipc_params[5] = output_size;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(output_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_finish(ifx_se_aead_operation_t *operation,
                                   ifx_se_fih_ptr_t ciphertext,
                                   ifx_se_fih_t ciphertext_size,
                                   ifx_se_fih_ptr_t ciphertext_length,
                                   ifx_se_fih_ptr_t tag,
                                   ifx_se_fih_t tag_size,
                                   ifx_se_fih_ptr_t tag_length,
                                   void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 7 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(7u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_FINISH;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(ciphertext);
    ipc_params[3] = ciphertext_size;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(ciphertext_length);
    ipc_params[5] = ifx_se_fih_ptr_to_uint(tag);
    ipc_params[6] = tag_size;
    ipc_params[7] = ifx_se_fih_ptr_to_uint(tag_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_verify(ifx_se_aead_operation_t *operation,
                                   ifx_se_fih_ptr_t plaintext,
                                   ifx_se_fih_t plaintext_size,
                                   ifx_se_fih_ptr_t plaintext_length,
                                   const ifx_se_fih_ptr_t tag,
                                   ifx_se_fih_t tag_length,
                                   void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 6 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(6u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_VERIFY;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(plaintext);
    ipc_params[3] = plaintext_size;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(plaintext_length);
    ipc_params[5] = ifx_se_fih_ptr_to_uint(tag);
    ipc_params[6] = tag_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_aead_abort(ifx_se_aead_operation_t *operation, void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 1 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(1u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_AEAD_ABORT;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_cipher_encrypt(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t iv,
    ifx_se_fih_t iv_length,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    ifx_se_fih_ptr_t output,
    ifx_se_fih_t output_size,
    ifx_se_fih_ptr_t output_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 10 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(10u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_CIPHER_ENCRYPT;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(iv);
    ipc_params[5] = iv_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[7] = input_length;
    ipc_params[8] = ifx_se_fih_ptr_to_uint(output);
    ipc_params[9] = output_size;
    ipc_params[10] = ifx_se_fih_ptr_to_uint(output_length);

