PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.c
    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_cipher_decrypt(ifx_se_key_id_fih_t key,
                                      ifx_se_alg_fih_t alg,
                                      const ifx_se_fih_ptr_t input,
                                      ifx_se_fih_t input_length,
                                      ifx_se_fih_ptr_t output,
                                      ifx_se_fih_t output_size,
                                      ifx_se_fih_ptr_t output_length,
                                      void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 8 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(8u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_CIPHER_DECRYPT;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[5] = input_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(output);
    ipc_params[7] = output_size;
    ipc_params[8] = ifx_se_fih_ptr_to_uint(output_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_cipher_encrypt_setup(
    ifx_se_cipher_operation_t *operation,
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_CIPHER_ENCRYPT_SETUP;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = key.key_id;
    ipc_params[3] = key.owner;
    ipc_params[4] = alg;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_cipher_decrypt_setup(
    ifx_se_cipher_operation_t *operation,
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_CIPHER_DECRYPT_SETUP;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = key.key_id;
    ipc_params[3] = key.owner;
    ipc_params[4] = alg;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_cipher_finish(
    ifx_se_cipher_operation_t *operation,
    ifx_se_fih_ptr_t output,
    ifx_se_fih_t output_size,
    ifx_se_fih_ptr_t output_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_CIPHER_FINISH;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(output);
    ipc_params[3] = output_size;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(output_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_cipher_generate_iv(
    ifx_se_cipher_operation_t *operation,
    ifx_se_fih_ptr_t iv,
    ifx_se_fih_t iv_size,
    ifx_se_fih_ptr_t iv_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_CIPHER_GENERATE_IV;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(iv);
    ipc_params[3] = iv_size;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(iv_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_cipher_set_iv(
    ifx_se_cipher_operation_t *operation,
    const ifx_se_fih_ptr_t iv,
    ifx_se_fih_t iv_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 3 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(3u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_CIPHER_SET_IV;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(iv);
    ipc_params[3] = iv_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_cipher_update(
    ifx_se_cipher_operation_t *operation,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    ifx_se_fih_ptr_t output,
    ifx_se_fih_t output_size,
    ifx_se_fih_ptr_t output_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 6 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(6u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_CIPHER_UPDATE;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[3] = input_length;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(output);
    ipc_params[5] = output_size;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(output_length);

