PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.c
    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_copy_key(ifx_se_key_id_fih_t source_key,
                                const ifx_se_key_attributes_t *attributes,
                                ifx_se_fih_ptr_t target_key,
                                void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_COPY_KEY;
    ipc_params[1] = source_key.key_id;
    ipc_params[2] = source_key.owner;
    ipc_params[3] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(attributes));
    ipc_params[4] = ifx_se_fih_ptr_to_uint(target_key);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_key_derivation_output_key(
    const ifx_se_key_attributes_t *attributes,
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_fih_ptr_t key,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 3 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(3u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_KEY_DERIVATION_OUTPUT_KEY;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(attributes));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[3] = ifx_se_fih_ptr_to_uint(key);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_key_derivation_input_key(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_key_derivation_step_t step,
    ifx_se_key_id_fih_t key,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_KEY_DERIVATION_INPUT_KEY;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_uint_encode(step);
    ipc_params[3] = key.key_id;
    ipc_params[4] = key.owner;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_key_derivation_input_bytes(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_key_derivation_step_t step,
    const ifx_se_fih_ptr_t data,
    ifx_se_fih_t data_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_KEY_DERIVATION_INPUT_BYTES;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_uint_encode(step);
    ipc_params[3] = ifx_se_fih_ptr_to_uint(data);
    ipc_params[4] = data_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_key_derivation_output_bytes(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_fih_ptr_t output,
    ifx_se_fih_t output_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 3 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(3u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_KEY_DERIVATION_OUTPUT_BYTES;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(output);
    ipc_params[3] = output_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}


ifx_se_status_t ifx_se_key_derivation_setup(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_alg_fih_t alg,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 2 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(2u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_KEY_DERIVATION_SETUP;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = alg;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_key_derivation_get_capacity(
    const ifx_se_key_derivation_operation_t *operation,
    ifx_se_fih_ptr_t capacity,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 2 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(2u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_KEY_DERIVATION_GET_CAPACITY;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_ptr_to_uint(capacity);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

