PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.c
    return status;
}

ifx_se_status_t ifx_se_key_derivation_set_capacity(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_fih_t capacity,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 2 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(2u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_KEY_DERIVATION_SET_CAPACITY;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = capacity;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_key_derivation_key_agreement(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_key_derivation_step_t step,
    ifx_se_key_id_fih_t private_key,
    const ifx_se_fih_ptr_t peer_key,
    ifx_se_fih_t peer_key_length,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 6 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(6u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_KEY_DERIVATION_AGREEMENT;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = ifx_se_fih_uint_encode(step);
    ipc_params[3] = private_key.key_id;
    ipc_params[4] = private_key.owner;
    ipc_params[5] = ifx_se_fih_ptr_to_uint(peer_key);
    ipc_params[6] = peer_key_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_raw_key_agreement(ifx_se_alg_fih_t alg,
        ifx_se_key_id_fih_t private_key,
        const ifx_se_fih_ptr_t peer_key,
        ifx_se_fih_t peer_key_length,
        ifx_se_fih_ptr_t output,
        ifx_se_fih_t output_size,
        ifx_se_fih_ptr_t output_length,
        void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 8 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(8u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_RAW_KEY_AGREEMENT;
    ipc_params[1] = alg;
    ipc_params[2] = private_key.key_id;
    ipc_params[3] = private_key.owner;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(peer_key);
    ipc_params[5] = peer_key_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(output);
    ipc_params[7] = output_size;
    ipc_params[8] = ifx_se_fih_ptr_to_uint(output_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_mac_compute(ifx_se_key_id_fih_t key,
                                   ifx_se_alg_fih_t alg,
                                   const ifx_se_fih_ptr_t input,
                                   ifx_se_fih_t input_length,
                                   ifx_se_fih_ptr_t mac,
                                   ifx_se_fih_t mac_size,
                                   ifx_se_fih_ptr_t mac_length,
                                   void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 8 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(8u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_MAC_COMPUTE;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[5] = input_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(mac);
    ipc_params[7] = mac_size;
    ipc_params[8] = ifx_se_fih_ptr_to_uint(mac_length);

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_mac_verify(ifx_se_key_id_fih_t key,
                                  ifx_se_alg_fih_t alg,
                                  const ifx_se_fih_ptr_t input,
                                  ifx_se_fih_t input_length,
                                  const ifx_se_fih_ptr_t mac,
                                  ifx_se_fih_t mac_length,
                                  void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 7 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(7u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_MAC_VERIFY;
    ipc_params[1] = key.key_id;
    ipc_params[2] = key.owner;
    ipc_params[3] = alg;
    ipc_params[4] = ifx_se_fih_ptr_to_uint(input);
    ipc_params[5] = input_length;
    ipc_params[6] = ifx_se_fih_ptr_to_uint(mac);
    ipc_params[7] = mac_length;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

    return status;
}

ifx_se_status_t ifx_se_mac_sign_setup(
    ifx_se_mac_operation_t *operation,
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    void *ctx)
{
    ifx_se_status_t status = IFX_SE_SYSCALL_CORRUPTION_DETECTED;

    /* 4 parameters */
    uint32_t ipc_packet[SE_RT_PACKET_CALC_SIZE(4u)]; /* in 32-bit words (4 bytes) */
    ifx_se_fih_uint *ipc_params = SE_RT_PARAMS_GET_PTR(ipc_packet);

    ipc_params[0] = IFX_SE_SYSCALL_PSA_MAC_SIGN_SETUP;
    ipc_params[1] = ifx_se_fih_ptr_to_uint(ifx_se_fih_ptr_encode(operation));
    ipc_params[2] = key.key_id;
    ipc_params[3] = key.owner;
    ipc_params[4] = alg;

    SE_RT_PACKET_FINALIZE(ipc_packet);

    status = ifx_se_syscall(ifx_se_fih_ptr_encode(ipc_packet), ifx_se_fih_uint_encode(sizeof(ipc_packet)), ctx);

